import Logo from "../assets/Logo.png";

export const examDate = [
  {
    id: 1,
    examDate: "2015",
  },
  {
    id: 2,
    examDate: "2016",
  },
  {
    id: 3,
    examDate: "2017",
  },
  {
    id: 4,
    examDate: "2018",
  },
  {
    id: 5,
    examDate: "2019",
  },
  {
    id: 6,
    examDate: "2021",
  },
  {
    id: 7,
    examDate: "2022",
  },
];
export const science = [
  {
    id: 1,
    image: Logo,
    description:
      "ភាសាខ្មែរ គឺជាភាសាកំណើតរបស់ជនជាតិខ្មែរនិងជាភាសាផ្លូវការរបស់ប្រទេសកម្ពុជា។ ភាសាសំស្ក្រឹតនិងភាសាបាលីបាន ជួយបង្កើតខេមរភាសា ព្រោះភាសាខ្មែរបានខ្ចីពាក្យច្រើនពីភាសាទាំងពីរនេះ។ មានអក្សរក្រមវែងជាងគេនៅលើពិភពលោក។ វាជាភាសាមួយដ៏ចំណាស់ ដែលប្រហែលជាមានដើមកំណើតតាំងតែពី ២០០០ឆ្នាំមុនមកម៉្លេះ។",
    categoryName: "ភាសាខ្មែរ",
  },
  {
    id: 2,
    image: Logo,
    description:
      "គណិតវិទ្យា ឬគណិតសាស្ត្រ គឺជាការសិក្សាអំពី បរិមាណ លេខ រចនាសម្ពន័្ធ រូបរាង ហើយនិងការផ្លាស់ប្ដូរ ។ គណិតសាស្រ្ដ អាចជាការស្វែងរកនូវគំរូ ប្រមាណវិធីបង្កើត រូបមន្ដន័យ និងការកត់ត្រា ផលិតប្រកួតប្រជែងសរសេរកូដ ។ គេអាចសរសេរ នូវ គំនូរ និង ការធ្វើបទពិសោធន៍ ។",
    categoryName: "គណិតវិទ្យា",
  },
  {
    id: 3,
    image: Logo,
    description:
      "ភាសាអង់គ្លេស (English) ជាភាសានៅទ្វីបអឺរ៉ុប ដែលមូលនៅ ប្រទេសអង់គ្លេស នៅសតវត្សរ៏ទី៥ ស.ក. ។ នៅពេលនេះមានប្រទេសច្រើន ដែលនិយាយភាសាអង់គ្លេសដូចភាសាកំណើត ជាពិសេស ប្រទេសអង់គ្លេស ប្រទេសសហរដ្ឋអាមេរិក និង ប្រទេសអូស្រ្តាលី និងមានប្រទេសទៀត ដែលនិយាយភាសាអង់គ្លេសដូច ភាសាទីពីរ ដូចជា ប្រទេសហ្វីលីពីន និង ប្រទេសឥណ្ឌា ។",
    categoryName: "អង់គ្លេស",
  },
  {
    id: 4,
    image: Logo,
    description:
      "រូបវិទ្យា មានន័យដោយត្រង់ថា វិទ្យាសាស្ត្រសិក្សាអំពីរូបធាតុនិងចលនារបស់វា។ រូបវិទ្យា ជា វិទ្យាសាស្ត្រ សិក្សាទាក់ទងនឹង កំលាំង ថាមពល ម៉ាស់ និង បន្ទុកអគ្គិសនី ជាដើម។ និយាយអោយទូលំទូលាយជាងនេះទៀត រូបវិទ្យា ជាការវិភាគវែកញែកពី ធម្មជាតិ ដើម្បីបកស្រាយពន្យល់ពី បាតុភូត ជុំវិញខ្លួនយើង និង កត្តាដែលបង្កវា។",
    categoryName: "រូបវិទ្យា",
  },
  {
    id: 5,
    image: Logo,
    description:
      "គីមីវិទ្យា ជាមុខវិជ្ជា ដែល ចាត់ចូល ក្នុង ប្រភេទវិទ្យាសាស្ត្រពិត និង ជាមុខវិជ្ជា ដែលសិក្សា អំពី លក្ខណៈ ក៏ដូចជា បម្លាស់ប្តូរ នៃរូបធាតុផ្សេងៗ នៅក្នុង សកលលោកទាំងមូល។ ក៏ព្រោះតែ ចំណេះដឹង គីមីវិទ្យា តែងតែត្រូវ គេប្រើរួមជាមួយ ចំណេះដឹងផ្សេងៗ ទៀតដើម្បី បង្កើតនូវអ្វីថ្មីៗផ្សេង គេបានឲ្យឈ្មោះមួយ សម្រាប់ វាថា វិទ្យាសាស្រ្តស្នូល។ គីមីវិទ្យា ជា មុខវិជ្ជាដែលធ្វើការសិក្សា លម្អិត ទៅលើ សមាសភាព ទម្រង់ មុខងារ និង សកម្មភាព ក្នុង ប្រតិកម្មគីមី មួយ របស់រូបធាតុ ទាំងឡាយនោះ។",
    categoryName: "គីមីវិទ្យា",
  },
  {
    id: 6,
    image: Logo,
    description:
      "ប្រវត្តិវិទ្យាគឺជាការសិក្សាអំពីហេតុការណ៍ ព្រឹត្តិការណ៍ បទពិសោធន៍អតីតកាលរបស់មនុស្សជាតិដោយពឹងផ្អែកលើកំណត់ត្រា និសក្ខីកម្មសម្រាប់សហសម័យ។ ម្យ៉ាងទៀតគឺជាវិជ្ជាសិក្សាអំពីអតីតកាលមនុស្សជាតិ និងសង្គមមនុស្ស ដែលប្រវត្តិវិទូព្យាយាមកសាងឡើងវិញ និងបកស្រាយឡើងវិញ ដោយផ្អែកលើកំណត់ត្រា និងសក្ខីកម្មសម្រាប់សហសម័យ។",
    categoryName: "ប្រវត្តិវិទ្យា",
  },
];
export const socialScience = [
  {
    id: 1,  
    image: Logo,
    description:
      "ភាសាខ្មែរ គឺជាភាសាកំណើតរបស់ជនជាតិខ្មែរនិងជាភាសាផ្លូវការរបស់ប្រទេសកម្ពុជា។ ភាសាសំស្ក្រឹតនិងភាសាបាលីបាន ជួយបង្កើតខេមរភាសា ព្រោះភាសាខ្មែរបានខ្ចីពាក្យច្រើនពីភាសាទាំងពីរនេះ។ មានអក្សរក្រមវែងជាងគេនៅលើពិភពលោក។ វាជាភាសាមួយដ៏ចំណាស់ ដែលប្រហែលជាមានដើមកំណើតតាំងតែពី ២០០០ឆ្នាំមុនមកម៉្លេះ។",
    categoryName: "ភាសាខ្មែរ",
  },
  {
    id: 2,
    image: Logo,
    description:
      "គណិតវិទ្យា ឬគណិតសាស្ត្រ គឺជាការសិក្សាអំពី បរិមាណ លេខ រចនាសម្ពន័្ធ រូបរាង ហើយនិងការផ្លាស់ប្ដូរ ។ គណិតសាស្រ្ដ អាចជាការស្វែងរកនូវគំរូ ប្រមាណវិធីបង្កើត រូបមន្ដន័យ និងការកត់ត្រា ផលិតប្រកួតប្រជែងសរសេរកូដ ។ គេអាចសរសេរ នូវ គំនូរ និង ការធ្វើបទពិសោធន៍ ។",
    categoryName: "គណិតវិទ្យា",
  },
  {
    id: 3,
    image: Logo,
    description:
      "ភាសាអង់គ្លេស (English) ជាភាសានៅទ្វីបអឺរ៉ុប ដែលមូលនៅ ប្រទេសអង់គ្លេស នៅសតវត្សរ៏ទី៥ ស.ក. ។ នៅពេលនេះមានប្រទេសច្រើន ដែលនិយាយភាសាអង់គ្លេសដូចភាសាកំណើត ជាពិសេស ប្រទេសអង់គ្លេស ប្រទេសសហរដ្ឋអាមេរិក និង ប្រទេសអូស្រ្តាលី និងមានប្រទេសទៀត ដែលនិយាយភាសាអង់គ្លេសដូច ភាសាទីពីរ ដូចជា ប្រទេសហ្វីលីពីន និង ប្រទេសឥណ្ឌា ។",
    categoryName: "អង់គ្លេស",
  },
  {
    id: 4,
    image: Logo,
    description:
      "ភូមិសាស្ត្រ ឬ ភូមិវិទ្យា គឺសិក្សាអំពីផែនដី ។ វិទ្យាសាស្ត្រ នេះបង្រៀនលក្ខណៈ ស្ទង់មហាសមុទ្រ ជួរភ្នំ ។ល។ ក៏រៀន ផងដែរអំពី ប្រជាជននៅដីមួយ (ប្រជាពលរដ្ឋ) និង គូរផែនទី។",
    categoryName: "ភូមិវិទ្យា",
  },
  {
    id: 5,
    image: Logo,
    description:
      "សីលធម៌ និងតម្លៃមនុស្ស សំដៅយកការប្រតិបត្តិអំពើសុចរិតតាមគន្លងធម៌ អាកប្បកិរិយា សមរម្យដែលសង្គមទទួលស្គាល់ ។ ដូចនេះមនុស្សត្រូវមានសីលធម៌ ចរិយាធម៌ សុជីវធម៌ គោរពច្បាប់ ប្រកាន់ខ្ជាប់អ្វីជាកុសល ដើម្បីរួមរស់ក្នុងសង្គមមួយប្រកបដោយសុវត្ថិភាព និងវឌ្ឍនភាព ។",
    categoryName: "សីលធម៌",
  },
  {
    id: 6,
    image: Logo,
    description:
      "ផែនដី (អង់គ្លេស: Earth) គឺ ជា ភពទី ៣ ពី ព្រះអាទិត្យ ហើយ ក៏ ជា ភព ណែន បំផុត និង ធំបំផុត ទី៥ ក្នុង ប្រព័ន្ធព្រះអាទិត្យ។ វា ក៏ ជា ភព ដី មួយ ក្នុង ចំណោម ភព ដី ទាំង៤ របស់ ប្រព័ន្ធ ព្រះអាទិត្យ។",
    categoryName: "ផែនដី",
  },
  {
    id: 7,
    image: Logo,
    description:
      "ប្រវត្តិវិទ្យាគឺជាការសិក្សាអំពីហេតុការណ៍ ព្រឹត្តិការណ៍ បទពិសោធន៍អតីតកាលរបស់មនុស្សជាតិដោយពឹងផ្អែកលើកំណត់ត្រា និសក្ខីកម្មសម្រាប់សហសម័យ។ ម្យ៉ាងទៀតគឺជាវិជ្ជាសិក្សាអំពីអតីតកាលមនុស្សជាតិ និងសង្គមមនុស្ស ដែលប្រវត្តិវិទូព្យាយាមកសាងឡើងវិញ និងបកស្រាយឡើងវិញ ដោយផ្អែកលើកំណត់ត្រា និងសក្ខីកម្មសម្រាប់សហសម័យ។",
    categoryName: "ប្រវត្តិវិទ្យា",
  },
];
